.config/emacs/init.el
(defvar korv/default-font-size 140)
(defvar korv/default-variable-font-size 140)
(defvar korv/frame-transparency '(100 . 100))
(defvar korv/font-name "LigaSFMono Nerd Font")

(setq gc-cons-threshold (* 50 1000 1000))

(defun korv/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))

;; Add the startup function to the emacs-startup-hook
(add-hook 'emacs-startup-hook #'korv/display-startup-time)

(setq inhibit-startup-message t)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 10)
(menu-bar-mode -1)

(setq visual-bell t)

(set-frame-parameter (selected-frame) 'alpha korv/frame-transparency)
(add-to-list 'default-frame-alist `(alpha . ,korv/frame-transparency))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))

(set-face-attribute 'default nil :font korv/font-name :height korv/default-font-size)
(set-face-attribute 'fixed-pitch nil :font korv/font-name :height korv/default-font-size)
(set-face-attribute 'variable-pitch nil :font korv/font-name :height korv/default-variable-font-size :weight 'regular)

;; Set <ESC> to escape globally
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; Change some global defaults
(column-number-mode)
(global-display-line-numbers-mode t)
(setq tab-always-indent 'complete)
(defalias 'yes-or-no-p 'y-or-n-p)
(show-paren-mode 1)
(electric-pair-mode 1)
(setq backup-direcotry-alist '(("." . "~/.cache/emacssaves"))
      create-lockfiles nil
      initial-major-mode 'fundamental-mode
      initial-scratch-message nil
      tab-width 2)

(setq-default
 auto-save-list-file-prefix nil
 cursor-in-non-selected-windows nil
 fill-column 80
 help-window-select t
 indent-tabs-mode nil
 select-enable-clipboard t
 x-stretch-cursor t)

(blink-cursor-mode 0)
(delete-selection-mode t)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode -1))))

(set-default-coding-systems 'utf-8)

(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

;; Setup use-package
(require 'use-package)
(setq use-package-always-ensure t)

(use-package no-littering
  :ensure t
  :config
  (require 'recentf)
  (add-to-list 'recentf-exclude no-littering-var-directory)
  (add-to-list 'recentf-exclude no-littering-etc-directory))

(use-package modus-themes
  :config
  (setq modus-themes-hl-line '(intense)))

(use-package doom-themes
  :config
  (load-theme 'doom-laserwave t))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 0.5))

(use-package all-the-icons
  :ensure t)

(use-package vertico
  :ensure t
  :bind (:map vertico-map
              ("C-g" . vertico-exit))
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))

(use-package savehist
  :init
  (savehist-mode))

(use-package marginalia
  :after vertico
  :ensure t
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))

(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless))
  (completion-category-defaults nil)
  (completion-cattegory-overrides '((file (styles partial-completion)))))

(use-package consult
  :init
  (setq register-preview-delay 0)
  (setq register-preview-function #'consult-register-format)
  (advice-add #'register-preview :override #'consult-register-window)
  (advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)
  :config
  (setq consult-preview-key 'any)
  (setq consult-narrow-key "<") ;; (kbd "C-+")
  (setq consult-project-root-function
        (lambda ()
          (when-let (project (project-current))
            (car (project-roots project))))))

(use-package corfu
  :custom
  (corfu-cycle t)
  (corfu-auto t)
  (corfu-quit-at-boundary t)
  (corfu-quit-no-match t)
  (corfu-preselect-first t)
  (corfu-echo-documentation nil)
  :bind
  (:map corfu-map
        ("TAB" . corfu-next)
        ([tab] . corfu-next)
        ("S-TAB" . corfu-previous)
        ([backtab] . corfu-previous))
  :init
  (corfu-global-mode))

;; TODO: Remap keybinds?

(use-package cape
  :bind (("C-c p p" . completion-at-point)
         ("C-c p t" . complete-tag)
         ("C-c p d" . cape-dabbrev)
         ("C-c p f" . cape-file)
         ("C-c p k" . cape-keyword)
         ("C-C p a" . cape-abbrev))
  :init
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-abbrev)
  (add-to-list 'completion-at-point-functions #'cape-keyword))

(use-package dabbrev)

(use-package doom-modeline
  :ensure t
  :init
  (doom-modeline-mode 1))
