.config/emacs/Emacs.org
*** Dashboard

A nice dashboard greets you when you run Emacs.

#+begin_src emacs-lisp

  (use-package dashboard
    :custom
    (initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
    (dashboard-banner-logo "")
    (dashboard-startup-banner 'logo)
    (dashboard-center-content t)
    (dashboard-show-shortcuts t)
    (dashboard-projects-backend 'project-el)
    (dashboard-items '((recents . 5)
                       (projects . 5)))
    (dashboard-set-heading-icons t)
    (dashboard-set-file-icons t)
    (dashboard-set-init-info t)
    :hook
    (dashboard-mode . (lambda () (setq global-hl-line-mode nil)))
    :config
    (dashboard-setup-startup-hook))

  (use-package page-break-lines
    :after dashboard
    :config
    (page-break-lines-mode))
#+end_src

And bracket pair matching

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

* Keybinds!

The meat and potatoes, as I like to call it.

** The Dark Side (Evil)

I like Vim keybinds. They be nice and cozy. Sue me! Evil gives me that. And Evil collection adds evil-mode to alot more commonly used mode. (Unbound the "C-s" for fun)

#+begin_src emacs-lisp

  (global-unset-key (kbd "C-s"))

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'message-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src


** General

A package to configure your own isolated key bindings. And one which I use all the time. Great stuff.

#+begin_src emacs-lisp

  (use-package general
    :config
    (general-create-definer korv/leader-keys
      :keymaps '(normal emacs)
      :prefix "C-,"
      :global-prefix ",")

    (korv/leader-keys
     "b" '(:ignore t :which-key "buffers")
     "bs" '(consult-buffer :which-key "Switch buffer")
     "bk" '(kill-current-buffer :which-key "Kill buffer")
     "w" '(:ignore t :which-key "windows")
     "wv" '(evil-window-vsplit :which-key "Vertical split")
     "ws" '(evil-window-split :which-key "Horizontal split")
     "wh" '(evil-window-left :which-key "Focus left")
     "wj" '(evil-window-down :which-key "Focus down")
     "wk" '(evil-window-up :which-key "Focus up")
     "wl" '(evil-window-right :which-key "Focus right")
     "wc" '(delete-window :which-key "Close window")
     "o" '(:ignore t :which-key "open")
     "oe" '(eshell :which-key "Eshell")
     "ot" '(vterm :which-key "Vterm")
     "f" '(:ignore t :which-key "file")
     "ff" '(find-file :which-key "Find File")
     "fr" '(consult-recent-file :which-key "Recent files")
     "fs" '(save-buffer :which-key "Save file")
     "fl" '(consult-line :which-key "Search file")
     "q" '(:ignore t :which-key "session")
     "qq" '(kill-emacs :which-key "Quit Emacs")
     "h" '(:ignore t :which-key "help")
     "hf" '(describe-function :which-key "Describe function")
     "hv" '(describe-variable :which-key "Describe variable")))

#+end_src

* Org Mode

One of the best pieces of software I've come in contact with. Although I don't utilize it to it's full potential, it has more potential than Harry Potter. Ok, maybe that isn't saying much. But it's cracked.

A function (from EFS) for setting up better font rendering in Org files.

#+begin_src emacs-lisp

  (defun korv/org-font-setup ()

    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) ""))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "JetBrainsMono Nerd Font" :weight 'regular :height (cdr face)))

    ;; Ensure fixed pitch appears as fixed pitch
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

#+end_src

Some minor modes to enable when we enter org-mode

#+begin_src emacs-lisp

  (defun korv/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

#+end_src

And now we configure the package. Beauty of use-package I think.

#+begin_src emacs-lisp

  (use-package org
    :pin org
    :commands (org-capture org-agenda)
    :hook (org-mode . korv/org-mode-setup)
    :config
    (require 'org-tempo)

    ;; Add <el and <sh snippet for quicker code blocks
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))

    (setq org-confirm-babel-evaluate nil
          org-ellipsis " ▾")

    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (korv/org-font-setup)

    ;; Enable emacs-lisp in the code blocks
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t))))


#+end_src

Some visual changes in the org buffer apart from fonts

#+begin_src emacs-lisp

;; Nicer heading bullets
(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("" "○" "●" "○" "●" "○" "●")))

;; Center org buffer
(defun korv/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
	visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . korv/org-mode-visual-fill))

#+end_src

Add auto-tangle when the file changes

#+begin_src emacs-lisp

  (defun korv/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.dotfiles/.config/emacs/Emacs.org"))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'korv/org-babel-tangle-config)))

#+end_src

